# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# MobileNetV3-small backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MobileNetV3Slice, [24, None, 4, True]], # 0-P3/8
    [-1, 1, MobileNetV3Slice, [48, 4, 9, True]], # 1-P4/16
    [-1, 1, MobileNetV3Slice, [576, 9, None, True]] # 2-P5/32
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 1], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [512, False]], # 6

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 0], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [256, False]], # 10 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 7], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [512, False]], # 13 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 3], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [1024, False]], # 16 (P5/32-large)

    [[10, 13, 16], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
